app/views/blogs/index.html.erb

                  data: { confirm: 'Are you sure?' } %></td>
                  <td><p><%= blog.likes.count %> <%= (blog.likes.count) == 1 ? 'Like' : 'Likes'%></p></td>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`blog_id` = 1