app/views/comments/_comments.html.erb

<div class="container">
  <% @blog.comments.each do |comment|%>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`blog_id` = 1