app/controllers/blogs_controller.rb

SELECT `blogs`.* FROM `blogs`
---
	def index
    @blogs = Blog.all

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
---
	def show
    @blog = Blog.find(params[:id])

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
---
  def edit
    @blog = Blog.find(params[:id])

INSERT INTO `blogs` (`title`, `created_at`, `updated_at`, `image`) VALUES ('My blog for social media', '2019-12-22 16:09:42', '2019-12-22 16:09:42', 'Add-User.png')
---
  def create
    @blog = Blog.new(blog_params)

    if @blog.save

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 2 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 2
---
  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy