app/controllers/comments_controller.rb

	def create
    @blog = Blog.find(params[:blog_id])
    @comment = @blog.comments.create(comment_params)
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `blog_id`, `created_at`, `updated_at`) VALUES ('Sali', 'nice', 1, '2019-12-22 16:10:38', '2019-12-22 16:10:38')

  def edit
    @blog= Blog.find(params[:blog_id])
    @comment = @blog.comments.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`blog_id` = 1 AND `comments`.`id` = 1 LIMIT 1

  def update
    @blog = Blog.find(params[:blog_id])
    @comment = @blog.comments.find(params[:id])

    if @comment.update(comment_params)
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`blog_id` = 1 AND `comments`.`id` = 1 LIMIT 1
UPDATE `comments` SET `body` = 'nice!!!', `updated_at` = '2019-12-22 17:16:45' WHERE `comments`.`id` = 1