app/controllers/likes_controller.rb

INSERT INTO `likes` (`blog_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2019-12-22 16:30:12', '2019-12-22 16:30:12')
---
  def create
    @blog.likes.create(user_id: current_user.id)

DELETE FROM `likes` WHERE `likes`.`id` = 1
---
  def destroy
	  if !(already_liked?)
	    flash[:notice] = "Cannot unlike"
	  else
	    @like.destroy

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
---
  def find_blog
    @blog = Blog.find(params[:blog_id])

SELECT  `likes`.* FROM `likes` WHERE `likes`.`blog_id` = 1 AND `likes`.`id` = 1 LIMIT 1
---
  def find_like
	  @like = @blog.likes.find(params[:id])